products/admin/fedexwsdl/RateRequest_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
           <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>Rate a Single Package v13</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:ReturnTransitAndCommit>1</v13:ReturnTransitAndCommit>
         <v13:CarrierCodes>FDXE</v13:CarrierCodes>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-15T09:30:47-05:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>PRIORITY_OVERNIGHT</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:Shipper>
              <v13:AccountNumber></v13:AccountNumber>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>1057</v13:Number>
                  <v13:Usage>ShipperTinsUsage</v13:Usage>
               </v13:Tins>
               <v13:Contact>
                  <v13:ContactId>SY32030</v13:ContactId>
                  <v13:PersonName>Sunil Yadav</v13:PersonName>
                  <v13:CompanyName>Syntel Inc</v13:CompanyName>
                  <v13:PhoneNumber>9545871684</v13:PhoneNumber>
                  <v13:PhoneExtension>020</v13:PhoneExtension>
                  <v13:EMailAddress>sunil_yadav3@syntelinc.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 2</v13:StreetLines>
                  <v13:City>COLORADO SPRINGS</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80915</v13:PostalCode>
                  <v13:UrbanizationCode>CO</v13:UrbanizationCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>Receipient</v13:PersonName>
                  <v13:CompanyName>Receiver Org</v13:CompanyName>
                  <v13:PhoneNumber>9982145555</v13:PhoneNumber>
                  <v13:PhoneExtension>011</v13:PhoneExtension>
                  <v13:EMailAddress>receiver@yahoo.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE 1</v13:StreetLines>
                  <v13:StreetLines>RECIPIENT ADDRESS LINE 2</v13:StreetLines>
                  <v13:City>DENVER</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80204</v13:PostalCode>
                  <v13:UrbanizationCode>CO</v13:UrbanizationCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Recipient>
            <v13:RecipientLocationNumber>DEN001</v13:RecipientLocationNumber>
            <v13:Origin>
               <v13:Contact>
                  <v13:ContactId>SY32030</v13:ContactId>
                  <v13:PersonName>Sunil Yadav</v13:PersonName>
                  <v13:CompanyName>Syntel Inc</v13:CompanyName>
                  <v13:PhoneNumber>9545871684</v13:PhoneNumber>
                  <v13:PhoneExtension>020</v13:PhoneExtension>
                  <v13:EMailAddress>sunil_yadav3@syntelinc.com</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 1</v13:StreetLines>
                  <v13:StreetLines>SHIPPER ADDRESS LINE 2</v13:StreetLines>
                  <v13:City>COLORADO SPRINGS</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80915</v13:PostalCode>
                  <v13:UrbanizationCode>CO</v13:UrbanizationCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>0</v13:Residential>
               </v13:Address>
            </v13:Origin>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                   <v13:ResponsibleParty>
                        <v13:AccountNumber></v13:AccountNumber>
                        <v13:Tins>
                           <v13:TinType>BUSINESS_STATE</v13:TinType>
                           <v13:Number>123456</v13:Number>
                        </v13:Tins>
                     </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupNumber>1</v13:GroupNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>20.0</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>12</v13:Length>
                  <v13:Width>12</v13:Width>
                  <v13:Height>12</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:PhysicalPackaging>BAG</v13:PhysicalPackaging>
               <v13:ContentRecords>
                  <v13:PartNumber>PRTNMBR007</v13:PartNumber>
                  <v13:ItemNumber>ITMNMBR007</v13:ItemNumber>
                  <v13:ReceivedQuantity>10</v13:ReceivedQuantity>
                  <v13:Description>ContentDescription</v13:Description>
               </v13:ContentRecords>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>